# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
n = int(input('Кол-во журавликов сделанных детьми: '))
print('Петя сделал:',(n//6), 'Катя сделала:',((n//6)*4), 'Сережа сделал:',(n//6))
